"""
01:for loop(for文)
for文とは繰り返したい時に使うプログラムだよ

今日のトピック
Part01
・for文とは
・for文の作り方
・コメントアウトの方法その２
・インデント
・for文と変数i


一緒に手を動かしてプログラムを書いてみよう！
行がずれてても大丈夫！
"""


# for文
# プログラミングでは繰り返しがたくさん使われてるよ
# 繰り返しにはwhile文とfor文があるよ
# まずはfor文について理解しよう


# for文はこういう書き方をするよ
# まずは実行してみよう
for i in range(3):
    print("鼻から牛乳")

# range()の中に書かれている数だけ繰り返される
# for i in range(回数):という書き方をすればオッケー
# :(コロン)を忘れずに


# 問題
# 変数を作ってその変数に自分の目標を保存しよう
# for文を使って自分の目標を８８回繰り返し表示するプログラムを作ってみよう


# コメントアウトの方法その２
# ダブルクォーテーションやシングルクォーテーションを使ったコメントアウトもできるよ

a = 0


# インデントについて理解しよう
#a = 30000
#for i in range(10):
#    print(100)
#print(a)


# 問題
# 下のプログラムはそれぞれどこかが間違っています
# 間違いを直してください
#for i in range(10)
#    print("どここがおかしい")


#for a in range(2):
#print("ここがおかしい")

n = 8

#for a in range("n"):
#    print("これも直して")


# forの後の変数について理解しよう！
#for i in range(3):
#    print(i)



"""
今回のポイントまとめ
・for文とは
・for文の作り方
・コメントアウトの方法その２
・インデント
・for文と変数i
"""