"""
00:Variables(変数)
変数（へんすう）とは、データを入れる・保存する箱

今日のトピック
Part01
・変数とは
・変数の作り方

Part02
・print()関数
・コメントアウト
・変数の中身の変更(更新)


一緒に手を動かしてプログラムを書いてみよう！
行がずれてても大丈夫！

"""



# コンピュータに3+3の計算をしてもらいました
# コンピュータ：6だよ
# コンピュータに今やった計算の答えにさらに3を足して
# コンピュータ：今やった計算って何？？？？？

# コンピュータはやったことをすぐ忘れてしまう！

# でも上のケースのようにコンピュータに覚えておいて欲しいこともある
# そこで使うのが変数！

# 変数は箱みたいなものだと考えればOK！
# 変数にしまった文字や数などのデータをコンピュータは覚えておくことができる。

# 上のケースを変数を使って解決しよう！


"""
ポイント1
変数の名前 = 保存したいデータ
"""


# 変数の作り方の例
omise = "居酒屋"
osake="日本酒"
otsumami = '梅きゅうり'

oshiharaigaku = 300


"""
ポイント2
=の前後は１文字空けてもいいし空けなくてもいい

ポイント3
文字はダブルクォーテーションかシングルクォーテーションで囲おう！

ポイント４
変数の名前を日本語にするのはやめよう！
"""


# れんしゅうしてみよう！A
# watashiという変数を作ってそこに自分の名前を入れてみよう！
# 答えを↓↓↓に書いてみよう！



# れんしゅうしてみよう！B
# toshiという変数を作ってそこに自分のねんれいを入れてみよう！
# 答えを↓↓↓に書いてみよう！



# 変数に入れたデータが正しく入ってるかをテストしてみよう！
# テストはめっちゃ大事！
"""
ポイント5
print(表示したいデータ)と書くとデータの確認ができるよ
"""
# print()関数を使ってみよう！
U00 = "レイ"
U02 = "アスカ"
U05 = "マリ"


# れんしゅうしてみよう！C
# 変数を１つ作ってその変数にあなたが好きな食べ物を保存しよう！
# print()関数を使ってその変数の中身を表示させてみよう！
# 答えを↓↓↓に書いてみよう！



"""
ポイント6
コメントアウトをするとプログラムをスキップできるよ
"""
# 例えばこんなプログラムがあったとします
a = "ショートケーキ"
b = "努力と根性"
c = "大根"




"""
ポイント7
変数の中身は変更(更新)することができるよ
"""
kaworu = "第１使徒"

kaworu = "第１３使徒"









"""
今回のポイントまとめ
ポイント1
変数の名前 = 保存したいデータ

ポイント2
=の前後は１文字空けてもいいし空けなくてもいい
お好みでどうぞ

ポイント3
文字はダブルクォーテーションかシングルクォーテーションで囲おう！

ポイント４
変数の名前を日本語にするのはやめよう！

ポイント5
print(表示したいデータ)とするとデータの確認ができるよ

ポイント6
コメントアウトをするとプログラムをスキップできるよ

ポイント7
変数の中身は変更(更新することができるよ)
"""