# Tips
# 日本語にしたいときは「かな」
# 英語にしたいときは「英数」
# をおしてね

# 00:Variables(変数)
# 問題：〇に入る文字を入力しよう
# 変数（へんすう）とは、デ〇タを入れる・保存する箱

# コンピュータが3+3の計算をしてもらいました
# コンピュータ：6だよ
# コンピュータに今やった計算の答えにさらに3を足して
# コンピュータ：今やった計算って何？？？？？

# そこで使うのが変数！
# 変数にしまった文字や数などのデータは覚えておくことができるよ！


# 今日は変数の勉強
# 変数の作り方は、プログラミング言語によって少しづつ違う
# Pythonの場合は、
"""
ポイント1
変数の名前 = 保存したいデータ
"""
# という書き方をする。

# 変数の作り方の例
momen = "木綿豆腐"
nedan = 30000
osake="日本酒"
osake_nedan=1000
"""
ポイント2
=の前後は１文字空けてもいいし空けなくてもいい
お好みでどうぞ

ポイント3
変数に文字を入れたい場合は、"（ダブルクォーテーション）を使おう
"""


# れんしゅうしてみよう！A
# namaeという変数を作ってそこに自分の名前を入れてみよう！
# 例
namae = "💋💋とうふ💋💋"
# 答えを↓↓↓に書いてみよう！



# れんしゅうしてみよう！B
# toshiという変数を作ってそこに自分のねんれいを入れてみよう！
# ヒント：年齢は文字じゃなくて数字（数値）だよ
# 答えを↓↓↓に書いてみよう！



# 変数に入れたデータが正しく入ってるかをテストしてみよう！
# テストはめっちゃ大事！
# 今回はprint関数というものを使ってテストしてみよう！
"""
ポイント4
print(表示したいデータ)
"""
# 例
#print(namae)
# ↑↑↑の#を消してみよう！
# 変数namaeの中身を表示してくれるよ


# れんしゅうしてみよう！C
# れんしゅうしてみよう！AとBで作った変数の中身を表示してみよう！
# 答えを↓↓↓に書いてみよう！



# この違いを理解しよう！
# kazu = 2
# moji = "2"
#print(kazu*5)
#print(moji*5)
# ↑↑↑の#を消してみよう！
# *はかけざんの記号
# どちらも２に５をかけてるけど、全然違う結果になるよ



# れんしゅうしてみよう！D
# 変数を２つ（kinokoとtakenoko）を作ってみよう
# kinokoには自分のねんれいを入れてみよう
# takenokoには自分のねんれいを文字にしたものを入れてみよう
# print関数を使って、いろんな計算をしてみよう（ポイント５を見てね）
# ↓↓↓に答えを書いてみよう！



"""
ポイント５
たしざんは+（shit+れ）
ひきざんは-（ほ）
かけざんは*（shit+け）
わりざんは/（め）

かけざんとわりざんだけ算数の時に使う記号と違う
"""


# 変数の中身の更新
# 変数の中身は変更(更新)することができるよ


"""
ポイント6
変数の中身は変更(更新することができるよ)
"""


"""
今回のポイントまとめ
ポイント1
変数の名前 = 保存したいデータ

ポイント2
=の前後は１文字空けてもいいし空けなくてもいい
お好みでどうぞ

ポイント3
変数に文字を入れたい場合は、"（ダブルクォーテーション）を使おう

ポイント4
print(表示したいデータ)

ポイント５
たしざんは+（shit+れ）
ひきざんは-（ほ）
かけざんは*（shit+け）
わりざんは/（め）
かけざんとわりざんだけ算数の時に使う記号と違う

ポイント6
変数の中身は変更(更新することができるよ)
"""